---
kind: property
id: P:Autodesk.Revit.DB.FillPattern.LinesPerLength
source: html/9d1802db-68b1-6d95-b06c-57792c1aad6f.htm
---
# Autodesk.Revit.DB.FillPattern.LinesPerLength Property

Gets the number of solid lines that placed in unit length.

## Syntax (C#)
```csharp
public double LinesPerLength { get; }
```